<script setup lang="ts">
  // const { t } = useI18n();

  const items = [
    {
      label: 'Детальніше про товар',
      content:
        "БОРОШНО ПШЕНИЧНЕ.\nОрганічне житнє борошно грубого помелу, воно ж цільнозернове житнє борошно — виробляється з цільного зерна органічного жита, разом з оболонкою (висівками) та зародком. Завдячуючи цьому, таке борошно містить ту ж кількість вітамінів, мінеральних і поживних речовин та клітковини, як і цільні органічні зерна жита. Довгий час житнє борошно використовувалось тільки для промислового випікання чорного хліба.\nОднак, сьогодні воно все частіше з'являється на домашній кухні – з нього можна зробити печиво, млинці, оладки, пироги, перепічку та інші смаколики. Зазвичай до житнього борошна додають високосортне пшеничне борошно, так як житнє борошно містить менше клітковини, що позначається на пекарських якостях.\nПри замовленні від 500 кг, ціни обговорюються окремо",
    },
    {
      label: 'Детальніше про експортера',
      content:
        "Завдячуючи цьому, таке борошно містить ту ж кількість вітамінів, мінеральних і поживних речовин та клітковини, як і цільні органічні зерна жита. Довгий час житнє борошно використовувалось тільки для промислового випікання чорного хліба.\nОднак, сьогодні воно все частіше з'являється на домашній кухні – з нього можна зробити печиво, млинці, оладки, пироги, перепічку та інші смаколики. Зазвичай до житнього борошна додають високосортне пшеничне борошно, так як житнє борошно містить менше клітковини, що позначається на пекарських якостях.\nПри замовленні від 500 кг, ціни обговорюються окремо",
    },
  ];
</script>

<template>
  <UTabs
    :items="items"
    :ui="{
      wrapper: 'overflow-hidden mb-[25px] text-[12px] md:mb-[100px] md:text-[16px]',
      list: {
        base: 'bg-transparent overflow-x-scroll w-full gap-[25px] !flex md:gap-[30px] 4xl:gap-[50px] !text-[9px]',
        padding: 'p-0',
        marker: {
          base: 'hidden',
        },
        tab: {
          base: 'text-[15px] md:text-[20px] relative w-fit flex-0 4xl:text-[25px] text-black text-left ui-focus-visible:ring-0',
          inactive: 'text-status_gray',
          padding: 'p-0',
          active:
            'before:absolute before:w-full before:h-[1px] 3xl:before:h-[2px] before:bg-black before:bottom-[6px] before:left-[4px] md:before:bottom-[-2px]',
        },
      },
    }"
  />
</template>

<style scoped></style>
