<script setup lang="ts">
  const items = [
    {
      label: 'Що таке Ukrainemart?',
      content:
        'Це перша в Україні В2В платформа, через яку українські експортери можуть продавати свої товари міжнародним імпортерам.',
    },
    {
      label: 'Які товари можна експортувати?',
      content:
        'Це перша в Україні В2В платформа, через яку українські експортери можуть продавати свої товари міжнародним імпортерам.',
    },
    {
      label: 'У які країни можна експортувати товари?',
      content:
        'Це перша в Україні В2В платформа, через яку українські експортери можуть продавати свої товари міжнародним імпортерам.',
    },
    {
      label: 'Які вимоги до якості товарів для експорту?',
      content:
        'Це перша в Україні В2В платформа, через яку українські експортери можуть продавати свої товари міжнародним імпортерам.',
    },
    {
      label: 'Як проходить доставка та митниця при експорті?',
      content:
        'Це перша в Україні В2В платформа, через яку українські експортери можуть продавати свої товари міжнародним імпортерам.',
    },
  ];
</script>

<template>
  <UiAccordion :items="items" />
</template>

<style scoped></style>
