<script setup lang="ts"></script>

<template>
  <UiTextPortalPrimary class="leading-[15px] md:leading-[20px] 2xl:leading-[24px]">
    БОРОШНО ПШЕНИЧНЕ. Органічне житнє борошно грубого помелу, воно ж цільнозернове житнє борошно —
    виробляється з цільного зерна органічного жита, разом з оболонкою (висівками) та зародком.
    Завдячуючи цьому, таке борошно містить ту ж кількість вітамінів, мінеральних і поживних речовин
    та клітковини, як і цільні органічні зерна жита. Довгий час житнє борошно використовувалось
    тільки для промислового випікання чорного хліба. Однак, сьогодні воно все частіше з'являється на
    домашній кухні – з нього можна зробити печиво, млинці, оладки, пироги, перепічку та інші
    смаколики. Зазвичай до житнього борошна додають високосортне пшеничне борошно, так як житнє
    борошно містить менше клітковини, що позначається на пекарських якостях. При замовленні від 500
    кг, ціни обговорюються окремо.
  </UiTextPortalPrimary>
</template>

<style></style>
